project37cat/STM32-geiger-counter/mouse-project/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */

#include "ssd1306.h"
#include "rtc32.h"

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

RTC_HandleTypeDef hrtc;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


#define BOARD_LED_OFF  (HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET))
#define BOARD_LED_ON   (HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET))

#define BAT_DIV_OFF  (HAL_GPIO_WritePin(GPIOB, GPIO_PIN_11, GPIO_PIN_SET))
#define BAT_DIV_ON  (HAL_GPIO_WritePin(GPIOB, GPIO_PIN_11, GPIO_PIN_RESET))

#define HV_OFF  (HAL_GPIO_WritePin(GPIOB, GPIO_PIN_3, GPIO_PIN_SET))
#define HV_ON  (HAL_GPIO_WritePin(GPIOB, GPIO_PIN_3, GPIO_PIN_RESET))

#define BUTTON_1  (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_0))
#define BUTTON_2  (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1))


#define GEIGER_TIME 75

uint16_t radimp[GEIGER_TIME+1];   //pulse counter

uint32_t glog[128];

char strbuff[32];

volatile uint32_t gflag=0;   // flag - auto 1Hz - got geiger counter data
volatile uint32_t gcnt=0;    // counter - geiger counter data for the previous second
volatile uint32_t sescnt=0;  // counter - duration of the current session


//^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC1_Init(void);
static void MX_RTC_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM2_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

uint16_t get_bat(uint16_t vdd);
uint16_t get_vdd(void);
uint16_t get_adc(uint32_t channel, uint16_t samples);
void sys_standby(void);

void sys_init(void);
uint8_t button1_h(void);
uint8_t button2_h(void);

//^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
//>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

//-----------------------------------------------------------------------------
uint16_t get_adc(uint32_t channel, uint16_t samples)
    {

    ADC_ChannelConfTypeDef sConfig;

    sConfig.Channel = channel;
    sConfig.Rank = ADC_REGULAR_RANK_1;
    sConfig.SamplingTime = ADC_SAMPLETIME_239CYCLES_5;
    HAL_ADC_ConfigChannel(&hadc1, &sConfig);

    uint32_t tempdata = 0;

    for (uint16_t n=0; n<samples; n++)
      {
        HAL_ADC_Start(&hadc1);
        HAL_ADC_PollForConversion(&hadc1, 100);
        if(n) tempdata += HAL_ADC_GetValue(&hadc1);
        HAL_ADC_Stop(&hadc1);
      }

    tempdata /= samples-1;

    return (uint16_t)tempdata;
    }

//-----------------------------------------------------------------------------
uint16_t get_vdd(void)
    {
    uint16_t vrefint = get_adc(ADC_CHANNEL_VREFINT, 256);

    static uint16_t olddata = 0;

    if ((olddata == 0)
     || (vrefint == 0)
     || (vrefint == 4095)
     || (vrefint > olddata + 1)
     || (vrefint < olddata - 1))  { olddata = vrefint; }

    uint16_t vdd = 0;
    if(olddata) vdd=((1207*4095)/olddata);
    return vdd;
    }

