project37cat/STM32-geiger-counter/mouse-project/Src/main.c
//-----------------------------------------------------------------------------
uint16_t get_bat(uint16_t vdd)
    {
    uint16_t battery = get_adc(ADC_CHANNEL_9, 256);

    static uint16_t olddata = 0;

    if ((olddata == 0)
     || (battery == 0)
     || (battery == 4095)
     || (battery > olddata + 1)
     || (battery < olddata - 1))  { olddata = battery; }

    uint16_t bat = ((olddata*vdd)/4095)*2.010;
    return bat;
    }


//-----------------------------------------------------------------------------
uint8_t button1_h(void)
    {
    static uint8_t old=0;
    uint8_t new = BUTTON_1;

    if(new!=old)
        {
        HAL_Delay(50);
        new = BUTTON_1;
        if(new!=old) old=new;
        }
    return old;
    }

//-----------------------------------------------------------------------------
uint8_t button2_h(void)
    {
    static uint8_t old=0;
    uint8_t new = BUTTON_2;

    if(new!=old)
        {
        HAL_Delay(50);
        new = BUTTON_2;
        if(new!=old) old=new;
        }
    return old;
    }


//-----------------------------------------------------------------------------
void sys_backup(uint32_t newttot, uint32_t newdtot, uint8_t oledbright)
    {
    HAL_PWR_EnableBkUpAccess();
    __HAL_RCC_BKP_CLK_ENABLE();

    HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR2, newttot>>16);  //write backup data
    HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR3, newttot);

    HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR4, newdtot>>16);
    HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR5, newdtot);

    HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR6, oledbright);

    HAL_PWR_DisableBkUpAccess();
    __HAL_RCC_BKP_CLK_DISABLE();
    }


//-----------------------------------------------------------------------------
void draw_graph(void)
    {
    const uint8_t hight = 10;
    const uint8_t x = 0;
    const uint8_t y = 63;

    for(uint8_t k=0; k<75; k++)
        {
        uint8_t rm = radimp[k+1]/hight;
        if(rm>hight-1) rm=hight-1;

        uint8_t rm0 = radimp[k]/hight;
        if(rm0>hight-1) rm0=hight-1;

        if(k) oled_line(k-1+x,   y-(hight+1)-(radimp[k]%hight),
                        k+x,     y-(hight+1)-(radimp[k+1]%hight)); //draw top graph

        oled_line(k-1+x, y-hight+rm0+1,
                  k+x,   y-hight+rm+1);  //bottom part of graph
        }
    }


//-----------------------------------------------------------------------------
void draw_graph2(void)
    {
    const uint8_t hight = 11;
    const uint8_t y = 35;

    uint32_t max = 0;

    for(uint8_t i=0; i<128; i++)
        {
        if(glog[i]>max) max=glog[i];
        }

    uint32_t div = max/hight;

    for(uint8_t i=0; i<(128-1); i++)
        {
        uint32_t t = glog[i]/(div+1);
        uint32_t t2 = glog[i+1]/(div+1);

        oled_line(i, y-t, i+1, y-t2);

        if(i%2) oled_pixel(i, y+4);
        if(!(i%30)) oled_pixel(i+1, y+3);
        }

    oled_pixel(127, y+4);

    sprintf(strbuff, "x%lu",div+1);
    oled_print(0, y+16, strbuff);
    }


//-----------------------------------------------------------------------------
void sys_standby(void)
    {
    RCC->APB1ENR |= RCC_APB1ENR_PWREN;  // Enable PWR module
    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;  // Set SLEEPDEEP bit of Cortex System Control Register
    PWR->CR |= PWR_CR_PDDS;             // Select Standby mode
    PWR->CR |= PWR_CR_CWUF;             // Clear the WUF Wakeup Flag
    PWR->CSR |= PWR_CSR_EWUP;           // Enable WKUP pin
    __WFI();                            // Wait For Interrupt
    }


//-----------------------------------------------------------------------------
void sys_init(void)
    {
    HV_ON;      // HV converter circuit
    BAT_DIV_ON; // battery divider circuit

    HAL_ADCEx_Calibration_Start(&hadc1);  // ADC self-calibration

    HAL_TIM_Base_Start(&htim2);           // start pulse counter
    HAL_TIM_Base_Start_IT(&htim3);        // start 1sec timer

    oled_init();         // display init
    oled_char(0,7,128);
    oled_update();

    while(button1_h());
    HAL_Delay(50);
    }


//=============================================================================
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim3)  // 1 Hz interrupt
    {
    if(gflag)  { gcnt += htim2.Instance->CNT; }
    else       { gcnt = htim2.Instance->CNT;  }

    htim2.Instance->CNT = 0;  //clear the cnt register

    sescnt++;

    gflag=1;
    }


//^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ADC1_Init();
  MX_RTC_Init();
  MX_TIM3_Init();
  MX_TIM2_Init();
  /* USER CODE BEGIN 2 */

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  //>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

  //watchdog //xxx

  sys_init();

  uint8_t df = 0;  //display flag
  uint8_t pf = 0;  //poweroff flag

  uint8_t batlow = 0;   //battery low flag
  uint8_t batfail = 0;  //battery fail

  uint8_t ff=0;    //hardware fail flag
  uint8_t fcnt=0;

  uint8_t smode = 0;  //main screen mode
  uint8_t mmenu = 0;  //main menu

  uint8_t ssmenu = 0; //settigs menu
  uint8_t dtmenu = 0;
  uint8_t crmenu = 0;

  uint16_t oledbright = 0x0000;

  uint16_t sysvdd = 0x0000;   //Vdd
  uint16_t sysbat = 0x0000;   //Vbat

  uint32_t rate = 0x00000000;  //doserate
  uint32_t maxrate = 0x00000000; //peak doserate

  uint32_t gses = 0x00000000;  // total of pulses in the current session

  srtc_date_typedef srtc;   //current date and time
  srtc_date_typedef newsrtc;   //new date and time

