project37cat/STM32-geiger-counter/mouse-project/Src/main.c
  uint32_t sestime = 0;  // duration of the current session
  uint32_t tottime = 0;  // total duration of work (from bkp)
  uint32_t sesdose = 0;  // session dose
  uint32_t totdose = 0;  // total dose (from bkp)

  tottime = (HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR2)<<16) + HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR3);
  totdose = (HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR4)<<16) + HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR5);

  oledbright = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR6);
  oled_bright(oledbright);

  while(1)
    {
  //^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
  //>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
    if(gflag==1 && pf==0)  //-----------------> calculation <------------------
        {
        radimp[0] = (uint16_t)gcnt;
        for(uint8_t k=GEIGER_TIME; k>0; k--) radimp[k]=radimp[k-1]; //shift

        uint32_t tmprate=0;
        for(uint8_t k=GEIGER_TIME; k>0; k--) tmprate+=radimp[k]; //dose rate
        if(tmprate>999999) tmprate=999999; //overflow
        rate=tmprate;

        if(tmprate>maxrate) maxrate=tmprate;   //peak

        gses+=radimp[0];
        if(gses>999999UL*3600/GEIGER_TIME) gses=999999UL*3600/GEIGER_TIME;  //overflow

        sesdose = (gses*GEIGER_TIME/3600);   //dose

        sestime = sescnt;

        glog[0]=rate; //write log
        if(!(sestime%60)) for(uint8_t k=127; k>0; k--) glog[k]=glog[k-1]; //shift log

        counter_to_date(get_rtc_cnt(), &srtc);   //get date and time

        sysvdd = get_vdd();          // get Vdd
        sysbat = get_bat(sysvdd);    // get Vbat

        if(sysbat<3400) batlow=1;
        if(sysbat>3500) batlow=0;
        if(sysbat<3000) batfail=1;  // battery less than 3V

        if(radimp[0]==0)  // if no pulses
            {
            if(fcnt<GEIGER_TIME/2) fcnt++;
            else
                {
                ff=1;    //set flag - harware fail
                HV_OFF;  //turn off HV converter
                }
            }
        else fcnt=0;

        gflag=0;
        df=0;
        }

    if(pf==1 || batfail==1)  //------------> turn off the system <-------------
        {
        if(batfail==1)
            {
            oled_clear();
            oled_print(0,10,"BATTERY LOW");
            oled_update();
            HAL_Delay(1000);
            }
        sys_backup(tottime+sestime, totdose+sesdose, oledbright);
        oled_off();
        sys_standby();
        }

    if(df==0)  //--------------------------> display <-------------------------
        {
        oled_clear();

        if(ff) oled_char(40,7,'!');
        if(batlow) oled_line(0,9,35,9);

        sprintf(strbuff, "%1u.%03u", sysbat/1000, sysbat%1000);  // print battery voltage
        oled_print(0,7,strbuff);
        oled_char(31,7,'V');

        sprintf(strbuff, "%0u-%02u-%02u", srtc.wday, srtc.mday, srtc.month);  // print date
        oled_print(48,7,strbuff);

        sprintf(strbuff, "%02u:%02u", srtc.hour, srtc.minute);  // print time
        oled_print(99,7,strbuff);

        if(smode==0)  ////////////////////  main screen  //////////////////////
            {
            sprintf(strbuff," %6lu uR", sesdose);
            oled_print(0,24,strbuff);

            sprintf(strbuff," %6lu uR/h", maxrate);
            oled_print(0,34,strbuff);

            draw_graph();

            sprintf(strbuff,"%lu", rate);
            if(rate<=9) oled_print16x30(94, 46, strbuff );
            else if(rate<=99) oled_print16x30(87, 46, strbuff );
            else if(rate<=999) oled_print16x30(80, 46, strbuff );
            else oled_print(87, 34, strbuff );

            uint8_t tday = (sestime/86400)%100; //99 days max
            uint8_t thour = (sestime/3600)%24;
            uint8_t tminute = (sestime/60)%60;

            sprintf(strbuff, "%02u-%02u:%02u", tday, thour, tminute);
            oled_print(81,63,strbuff);
            }

        if(smode==1 && mmenu==0)  ///////////////  secondary screen  //////////////////
            {
            sprintf(strbuff, "%1u.%03u", sysvdd/1000, sysvdd%1000);  // print Vdd
            oled_print(0,19,strbuff);
            oled_char(31,19,'V');

            sprintf(strbuff, "-%04u", srtc.year);
            oled_print(60,18,strbuff);

            sprintf(strbuff, ":%02u", srtc.second);
            oled_print(111,18,strbuff);

            draw_graph2();

            sprintf(strbuff, "%10lu uR", totdose+sesdose);  //tot dose
            oled_print(0,63,strbuff);

            uint32_t newttot=tottime+sestime;
            uint16_t tday = (newttot/86400)%10000; //9999 days max
            uint8_t thour = (newttot/3600)%24;
            uint8_t tminute = (newttot/60)%60;

            sprintf(strbuff, "%4u", tday);  //tot day of work  //tot time of work
            oled_print(105,52,strbuff);

            sprintf(strbuff, "%02u:%02u", thour, tminute);
            oled_print(99,63,strbuff);
            }

        if(smode==1 && mmenu>0 && dtmenu==0  && crmenu==0 && ssmenu==0)  //////  Main menu  //////
            {
            newsrtc=srtc;  //update the data before setup entering

            oled_print(7,25,"General Settings");
            oled_print(7,37,"Set Date & Time");
            oled_print(7,49,"Clear Data");

            if(mmenu==1) oled_char(0,25,'>');
            if(mmenu==2) oled_char(0,37,'>');
            if(mmenu==3)
                {
                oled_char(0,49,'>');
                oled_print(98,63,"^exit"); //help
                }
            else oled_print(98,63,"^down"); //help

            }

        if(smode==1 && mmenu==1 && ssmenu>0)  //////  draw System Settings menu  ///////
            {
            sprintf(strbuff, "%03u", oledbright);
            oled_print(104,25,strbuff);
            oled_print(7,25,"Brightness");

            oled_print(7,37,"Run HV Converter");

            if(ssmenu==1) oled_char(0,25,'>');
            if(ssmenu==2) oled_char(0,37,'>');

            oled_print(86,63,"^change"); //help
            }

        if(smode==1 && mmenu==2 && dtmenu>0)  //////  draw Set Date and Time menu  /////
            {
            sprintf(strbuff, "-%04u", srtc.year);
            oled_print(59,18,strbuff);

            sprintf(strbuff, ":%02u", srtc.second);
            oled_print(110,18,strbuff);

            sprintf(strbuff, "%02u-%02u", newsrtc.mday, newsrtc.month);
            oled_print(59,35,strbuff);

            sprintf(strbuff, "%02u:%02u", newsrtc.hour, newsrtc.minute);
            oled_print(98,35,strbuff);

            sprintf(strbuff, "-%04u", newsrtc.year);
            oled_print(59,46,strbuff);

            sprintf(strbuff, ":%02u", newsrtc.second);
            oled_print(110,46,strbuff);

            if(dtmenu==1) { oled_char_inv(58,35,13); }  //invert selected item
            if(dtmenu==2) { oled_char_inv(76,35,13); }
            if(dtmenu==3) { oled_char_inv(64,46,25); }
            if(dtmenu==4) { oled_char_inv(97,35,13); }
            if(dtmenu==5) { oled_char_inv(115,35,13); }
            if(dtmenu==6) { oled_char_inv(115,46,13); }

            oled_print(86,63,"^change"); //help
            }

