project37cat/STM32-geiger-counter/mouse-project/Src/main.c
        if(smode==1 && mmenu==3 && crmenu>0)  ///////  draw the Clear Data menu  ///////
            {
            oled_print(7,25,"Current Dose Rate");
            oled_print(7,37,"Total Dose & Time");

            if(crmenu==1) oled_char(0,25,'>');
            if(crmenu==2) oled_char(0,37,'>');

            oled_print(93,63,"^clear"); //help
            }

        oled_update();
        df=1;
        }  // end of Display

    HAL_PWR_EnterSLEEPMode(PWR_MAINREGULATOR_ON, PWR_SLEEPENTRY_WFI);  //power down

    if(button1_h())  //------------------------>  button #1  <---------------------------
        {
        while(button1_h());

        if(smode==0)  //system off
            {
            pf=1;
            }

        if(smode==1)  //enter the main menu
            {
            if(dtmenu==0 && crmenu==0 && ssmenu==0)
                {
                if(++mmenu>3) mmenu=0;  // switching the main menu items
                }

            if(mmenu==1)  // General Settigs
                {
                if(ssmenu==1)  //display brightness
                    {
                    if((oledbright+=50)>250) oledbright=0;
                    oled_bright(oledbright);
                    }
                if(ssmenu==2)
                    {
                    fcnt=0;
                    ff=0;
                    HV_ON;
                    ssmenu=0; //clr for exit
                    mmenu=0;
                    smode=0;
                    }
                }

            if(mmenu==2)  //Set Date and Time
                {
                if(dtmenu==1)  { if(++newsrtc.mday>31)   newsrtc.mday=1;    }
                if(dtmenu==2)  { if(++newsrtc.month>12)  newsrtc.month=1;   }
                if(dtmenu==3)  { if(++newsrtc.year>2050) newsrtc.year=2018; }
                if(dtmenu==4)  { if(++newsrtc.hour>23)   newsrtc.hour=0;    }
                if(dtmenu==5)  { if(++newsrtc.minute>59) newsrtc.minute=0;  }
                if(dtmenu==6)  { newsrtc.second=0; }
                }

            if(mmenu==3)  //Clear Data
                {
                if(crmenu==1) //clear current dose rate
                    {
                    for(uint8_t k=0; k<(GEIGER_TIME+1); k++) radimp[k]=0;
                    maxrate=0;
                    rate=0;
                    crmenu=0; //clr for exit
                    mmenu=0;
                    smode=0;
                    }

                if(crmenu==2) //clear total dose and time
                    {
                    sescnt=0;  //clr timer
                    sestime=0;
                    tottime=0;
                    gses=0;    //clr dose
                    sesdose=0;
                    totdose=0;
                    crmenu=0;  //clr for exit
                    mmenu=0;
                    }
                }

            df=0;
            }
        }

    if(button2_h() && pf==0)  //--------------------> button #2  <-----------------------
        {
        while(button2_h());

        if(smode==0 || (smode==1 && mmenu==0))  // switching screens
            {
            if(++smode>1) smode=0;
            }

        if(smode==1 && mmenu==1)  // switching System Settings menu items
            {
            if(++ssmenu>2)
                {
                ssmenu=0;
                }
            }

        if(smode==1 && mmenu==2)  // switching the Set Time and Date menu items
            {
            if(++dtmenu>6)
                {
                dtmenu=0;
                write_rtc_cnt(date_to_counter(&newsrtc));  // save data
                srtc=newsrtc;
                }
            }

        if(smode==1 && mmenu==3)  // switching the Clear Menu items
            {
            if(++crmenu>2)
                {
                crmenu=0;
                }
            }

        df=0;
        }
    }  //end of main loop
  //^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE|RCC_OSCILLATORTYPE_LSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.LSEState = RCC_LSE_ON;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_RTC|RCC_PERIPHCLK_ADC;
  PeriphClkInit.RTCClockSelection = RCC_RTCCLKSOURCE_LSE;
  PeriphClkInit.AdcClockSelection = RCC_ADCPCLK2_DIV2;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* ADC1 init function */
static void MX_ADC1_Init(void)
{

